Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: གང་ཕྱིར་ལྡོག་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་ཀྱང་མི་བྱའོ།
en: If one regresses, that person should not be called a bodhisattva.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་གལ་ཏེ་འཕོང་གི་སློབ་དཔོན་གྱིས་མདའ་གཟས་པ་བཞིན་མི་འགྲོ་ན་དེ་འཕོང་གི་སློབ་དཔོན་ཞེས་མི་བྱའོ། །
en: Venerable Pūrṇa, as an analogy, if a master archer fails to hit a target with his arrow, he should not be called a master archer.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་སེམས་ལས་བྱུང་བ་རྣམས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མི་ལྡན་པ་འབྱུང་ངམ། ཡང་ན་སྦྱིན་པ་སྦྱིན་ནམ། ཚུལ་ཁྲིམས་སྲུང་ངམ། བཟོད་པ་སྒྲུབ་བམ། བརྩོན་འགྲུས་རྩོམ་མམ། བསམ་གཏན་རྣམས་ལ་མཉམ་པར་འཇོག་གམ། ཤེས་རབ་སྒོམ་ཡང་རུང་སྟེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་མི་སྔོ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཞེས་མི་བྱའོ།
en: Venerable Pūrṇa, likewise, if the mind and thoughts of bodhisattvas are not directed toward the state of omniscience, or if they practice generosity, observe discipline, cultivate patience, apply diligence, rest in concentration, or cultivate insight without dedicating the merit toward the state of omniscience, such bodhisattvas should not be described as observing discipline.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཇི་ལྟར་ཡོངས་སུ་བསྔོ་བ་ཡང་མི་ཤེས་ལ་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡང་ཡོངས་སུ་སྔོ་བར་མི་བྱེད་ན་ཡོངས་སུ་བསྔོ་བ་མེད་དུ་ཟིན་ཀྱང་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: Venerable Pūrṇa, even if bodhisattvas do not know how to dedicate toward the state of omniscience and accordingly do not perform any dedication of merit, it could still be said that they observe discipline as long as they abstain from any dedication aimed at the levels of the hearers or the solitary buddhas.

source: །ཡོངས་སུ་སྔོ་བར་བྱེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་དག་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ཏེ།
en: However, it is by proper dedication that bodhisattva great beings genuinely uphold the perfection of discipline. “

source: འོན་ཀྱང་ཚེ་དང་ལྡན་པ་གང་པོ་གཅིག་ནི་ཡུན་རིང་མོ་ཞིག་ནས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ལ་ཅིག་ཤོས་ནི་འདི་ལྟ་སྟེ། ཐབས་ལ་མཁས་པས་མྱུར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Venerable Pūrṇa, that said, some bodhisattvas only awaken after a long time while others, who are skilled in means, can awaken in a short time.

source: ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མི་མཁས་པ་ཡུན་རིང་མོ་ཞིག་ནས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ནི་བླའི། ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ལྷུང་བ་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: Nevertheless, Venerable Pūrṇa, the first type of bodhisattva, who is not skilled in means and therefore takes a long time to awaken, is not like those beings who fall easily into the levels of the hearers and solitary buddhas.

source: །མི་ཞིག་ཆོམ་རྐུན་གྱི་ཡ་ང་བ་ནས་མཆིས་ཏེ་འོངས་པ་ནི་བླའི་བཅོམ་སྟེ་མྱུར་དུ་འོངས་པ་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: As such, they are not like someone who easily and swiftly escapes the threat of bandits.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ། རིང་མོ་ཞིག་ནས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ནི་བླའི་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ལྷུང་བ་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: Venerable Pūrṇa, in that way, bodhisattvas who take a long time to awaken are different from those who fall easily into the levels of the hearers and solitary buddhas. “

source: །ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ནི་རྣམ་པ་གཉིས་སུ་འགྱུར་བར་ཤེས་པར་བྱ་སྟེ།
en: The bodhisattvas who are skilled in means and wish to awaken to unsurpassed and perfect buddhahood can be of two kinds.

source: ཡང་ན་ནི་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་རོ། །ཡང་ན་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Either they actualize the limit of reality or they swiftly awaken to unsurpassed and perfect buddhahood.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་ཁྱིམ་ཞིག་ཚིག་ལ་ཁྱིམ་ཚིག་པ་དེའི་ནང་ན་རིན་པོ་ཆེའི་ཕུང་པོ་འདུག་སྟེ།
en: Venerable Pūrṇa, think of the analogy of a burning house that contains a collection of gemstones.

source: རིན་པོ་ཆེ་འདོད་པའི་མི་ལ་ལ་ཞིག་ཁྱིམ་དེར་ཞུགས་ན་དེས་རྣམ་པ་གཉིས་སུ་འགྱུར་བར་ཤེས་པར་བྱ་སྟེ། ཡང་ན་ནི་ཁྱིམ་དེའི་ནང་དུ་ཚིག་པར་འགྱུར། ཡང་ན་ནི་རིན་པོ་ཆེ་དེ་དག་ཁྱེར་ཏེ་འབྱུང་བར་འགྱུར་རོ།
en: If the people who live in that house are fond of gemstones, two scenarios are possible: either they remain in the house and die in the fire or they pick up the gemstones and escape.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་ཡང་རྣམ་པ་གཉིས་སུ་འགྱུར་བར་ཤེས་པར་བྱ་སྟེ། ཡང་ན་ནི་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར། ཡང་ན་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Venerable Pūrṇa, likewise, for the bodhisattvas who are skilled in means and wish to swiftly awaken to unsurpassed and perfect buddhahood, two scenarios are possible: either they actualize the limit of reality or they swiftly awaken to unsurpassed and perfect buddhahood.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་བྱེད་པ་དེ་ཐབས་ལ་མཁས་པ་ཞེས་བྱའམ།
en: Venerable Pūrṇa asked, “Venerable Śāradvatīputra, are bodhisattvas who actualize the limit of reality considered skilled in means?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་བྱེད་པ་དེ་ནི་ཐབས་ལ་མཁས་པ་ཞེས་མི་བྱའོ།
en: Venerable Śāradvatīputra said, “Venerable Pūrṇa, no, bodhisattvas who actualize the limit of reality are not considered skilled in means.

source: ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ལྷུང་བ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པའི་རྒྱུ་འཐུན་པ་མ་ཡིན་གྱི།
en: Because falling into the levels of the hearers and solitary buddhas does not make bodhisattvas skilled in means.

source: དེ་ནི་ཐབས་ལ་མི་མཁས་པའི་རྒྱུ་འཐུན་པ་ཡིན་པའི་ཕྱིར་རོ།
en: In fact, it means that they are not skilled in means.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཏུ་སྤྱོད་པ་ན་བདག་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་གྱི། བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་ནི་མ་ཡིན་ནོ་སྙམ་དུ་རྣམ་པར་རྟོག་ན་དེ་སྤྱོད་ཡུལ་མ་ཡིན་པ་ལ་སྤྱོད་དེ།
en: Venerable Pūrṇa, moreover, when bodhisattvas are practicing for the sake of awakening, it is improper to think, ‘May I awaken to unsurpassed perfect buddhahood swiftly, but not other bodhisattvas!’

source: གང་སྤྱོད་ཡུལ་མ་ཡིན་པ་དེ་ནི་དེའི་ཚུལ་ཁྲིམས་ཀྱི་སྐྱོན་ཡིན་ནོ། །
en: This type of improper attitude is a fault in their discipline.

source: ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་བདག་ནི་སྦྱིན་པ་ཆེས་མང་བ་སྦྱིན་པ་ཡིན་ནོ། །བདག་ནི་ཚུལ་ཁྲིམས་སྲུང་བའོ། །བདག་ནི་བཟོད་པ་སྒྲུབ་པའོ། །བདག་ནི་བརྩོན་འགྲུས་རྩོམ་པའོ། །བདག་ནི་བསམ་གཏན་ལ་མཉམ་པར་འཇོག་པའོ། །བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན་གྱི། བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་ནི་མ་ཡིན་ནོ་སྙམ་དུ་དེ་ལྟར་རྣམ་པར་རྟོག་ན་ཡང་སྤྱོད་ཡུལ་མ་ཡིན་པ་ལ་སྤྱོད་དེ།
en: Venerable Pūrṇa, moreover, it is improper for bodhisattvas to think, ‘I practice vast generosity, I observe discipline, I cultivate patience, I apply diligence, I rest evenly in concentration, and I apply the perfection of insight. But other bodhisattvas do not.’

source: སྤྱོད་ཡུལ་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ནི་དེའི་ཚུལ་ཁྲིམས་ཀྱི་སྐྱོན་ཡིན་ནོ།
en: Such an improper attitude is a fault in their discipline.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་བདག་ནི་ཇི་ལྟར་ཡོངས་སུ་བསྔོ་བར་བྱ་བའི་ཡོངས་སུ་བསྔོ་བའི་ཐབས་ཤེས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་ནི་དེ་ལྟར་མི་ཤེས་སོ་སྙམ་དུ་སེམས་ན་ཡང་སྤྱོད་ཡུལ་མ་ཡིན་པ་ལ་སྤྱོད་དེ།
en: Venerable Pūrṇa, moreover, it is improper for bodhisattvas to think, ‘I know how to genuinely dedicate merit, yet other bodhisattvas do not.’

source: སྤྱོད་ཡུལ་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ནི་དེའི་ཚུལ་ཁྲིམས་ཀྱི་སྐྱོན་ནོ།
en: Such an improper attitude is a fault in their discipline.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་འདུག་ལ། འཁོར་ལོས་སྒྱུར་བའི་ཁ་ཟས་སྦྱིན་ཞིང་ཡོངས་སུ་གཏོང་བ་ཡང་བསོད་སྙོམས་གཅིག་དང་། སེམས་བསྐྱེད་པ་གཅིག་གིས་ཟིལ་གྱིས་གནན་པར་བྱའོ་སྙམ་དུ་སེམས་ན་སྤྱོད་ཡུལ་མ་ཡིན་པ་ལ་སྤྱོད་དེ།
en: Venerable Pūrṇa, moreover, it is improper for bodhisattvas to think, ‘With just a single offering of a meal and a single arousal of the mind of awakening I can surpass all other bodhisattvas, even if they were to live for as many eons as there are grains of sand in the Ganges, constantly offering food worthy of a universal monarch.’

source: སྤྱོད་ཡུལ་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ནི་དེའི་ཚུལ་ཁྲིམས་ཀྱི་སྐྱོན་ཡིན་ཏེ།
en: Such an improper attitude is a fault in their discipline.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཐབས་ལ་མཁས་པ་ཡིན་དུ་ཟིན་ཀྱང་རྣམ་པར་རྟོག་པ་འདི་ཇི་ལྟར་རྣམ་པར་རྟོག་ན་དེ་ཐབས་ལ་མཁས་པ་ཞེས་མི་བྱའོ།
en: Even though such bodhisattvas may generally be skilled in means, they should not be described in that way as long as they have such thoughts.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་བྱང་ཆུབ་སེམས་དཔའ་དང་མི་འཐུན་པར་མི་བྱ།
en: Because bodhisattvas do not conflict with other bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཁྱད་དུ་གསད་པར་མི་བྱ།
en: Bodhisattvas do not despise other bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་བརྙས་པར་མི་བྱའི།
en: Bodhisattvas do not mistreat other bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་ལ་གུས་པར་རིམ་གྲོ་བྱ་བ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའ་ལ་གུས་པ་བསྐྱེད་པར་བྱ་བའི་ཕྱིར་རོ།
en: Bodhisattvas respect other bodhisattvas, just as they would respectfully serve the Thus-Gone One.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཅི་བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་ལ་གུས་པར་རིམ་གྲོ་བྱའི།
en: Venerable Pūrṇa asked, “Venerable Śāradvatīputra, why should only bodhisattvas be served with respect?

source: སེམས་ཅན་གཞན་དག་ལ་ནི་གུས་པར་རིམ་གྲོ་མི་བྱའམ།
en: Should we not attend to other beings respectfully?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་གུས་པར་རིམ་གྲོ་བྱ་བ་བཞིན་དུ་གུས་པ་བསྐྱེད་པར་བྱའོ།
en: Venerable Śāradvatīputra said, “Yes, Venerable Pūrṇa, indeed we should respect all beings and serve them devotedly, just as we would serve the Thus-Gone One.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་ན་གུས་པར་རིམ་གྲོ་བྱའོ།
en: Likewise, when bodhisattvas see another bodhisattva, they should serve that person with respect.

source: །དེ་བཞིན་དུ་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་མཐོང་ན་ཡང་གུས་པར་རིམ་གྲོ་བྱའོ།
en: Likewise, if they see a practitioner who observes pure conduct, they should also serve that person with respect.

source: །དེ་བཞིན་དུ་སེམས་ཅན་གཞན་དག་ལ་ཡང་གུས་པར་རིམ་གྲོ་བྱའོ།
en: In the same way, they should serve all other beings with respect.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་དམའ་བའི་སེམས་དང་། གུས་པ་དང་བཅས་པ་དང་། ཞེ་ས་དང་བཅས་པར་བྱ་སྟེ། ང་རྒྱལ་སྤངས་པས་གུས་པར་རིམ་གྲོ་བྱའོ། །
en: Thus, bodhisattvas should serve others with an attitude of humbleness, respect, politeness, and humility.

source: འདི་ལྟར་ཡང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་འདི་དག་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་བྱའོ། །སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར་ཆོས་ཀྱང་བསྟན་པར་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱ་ཞིང་དེ་ལྟར་བསམ་པར་བྱའོ།
en: They should do so while forming the resolve, ‘Once I have awakened to unsurpassed and perfect buddhahood, I will bring these beings to the state beyond suffering and teach them the Dharma so that they may be free of afflictions.’

source: །ཚེ་དང་ལྡན་པ་གང་པོ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་རྣམས་ལ་དམའ་བའི་སེམས་སུ་བྱའོ། །བྱམས་པའི་སེམས་སུ་བྱའོ།
en: Venerable Pūrṇa, in this way bodhisattva great beings should be humble and loving toward others.

source: །སེམས་ཅན་དེ་དག་གི་མཆོག་ཏུ་འགྱུར་བར་བྱའོ།
en: They should be the best among beings.

source: །མཆོག་ཀྱང་བྱེད་དུ་གཞུག་པར་བྱའོ།
en: They should also bring out the best in them.

source: མཆོག་ཉིད་ནི་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: Because the best is buddhahood.

source: །འདི་ལྟར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་བྱམས་པ་བསྐྱེད་པར་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཆོས་ཀྱི་བདག་པོ་ལ་བདག་པོ་བྱེད་དུ་གཞུག་པར་བྱའོ།
en: Thus, bodhisattvas should love all other beings while inspiring them to take the Lord of the Dharma as their master.”

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་བཞི་པའོ།། །།
en: This is the fourth chapter from “The Perfection of Discipline.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཆོས་ཀྱི་བདག་པོར་མཆོག་བྱེད་དུ་འཇུག་སྟེ། འདོམས་ཤིང་རྗེས་སུ་སྟོན་པར་འགྱུར་རམ།
en: Venerable Pūrṇa Maitrāyaṇīputra said to Venerable Śāradvatīputra, “Venerable Śāradvatīputra, when bodhisattvas awaken to unsurpassed and perfect buddhahood, do all beings venerate them as masters of the Dharma, so that they explain and teach them?

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་མཁས་པས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་མངོན་པར་སྤྲུལ་ཏེ། རྒྱལ་པོ་དང་བཅས་པའི་སྡེ་མངོན་པར་སྤྲུལ་ན། ཅི་སྒྱུ་མའི་མི་དེ་དག་འདི་སྙམ་དུ་གང་བདག་ཅག་ལ་དབང་བྱེད་པའི་རྒྱལ་པོ་ནི་ཡོད་དོ་སྙམ་དུ་སེམས་སམ།
en: Venerable Śāradvatīputra, as an analogy, if a magician, or the skilled apprentice of a magician, were to conjure up an army with four divisions along with a magically created king, would the illusory soldiers not think that they had a king to rule them?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་དེ་ནི་མ་ཡིན་ནོ། །
en: Venerable Śāradvatīputra said, “No, Venerable One, they would not.”

source: སྨྲས་པ། ཅི་རྒྱལ་པོ་དེ་འདི་སྙམ་དུ་བདག་གི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་འདི་དག་ནི་ཡོད་དོ་སྙམ་དུ་སེམས་སམ།
en: Venerable Pūrṇa asked, “Well, would that king not think that the four divisions of his army existed?”

source: སྨྲས་པ། དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་དེ་དག་ཐམས་ཅད་ནི་རྫས་སུ་གཏོགས་པ་མ་ཡིན། དངོས་པོར་གཏོགས་པ་མ་ཡིན་ཏེ།
en: Venerable Pūrṇa said, “All of the four divisions of the army are immaterial and unreal.

source: རྫས་མ་ཡིན་པར་གཏོགས་པ་དངོས་པོ་མ་ཡིན་པར་གཏོགས་པ་ཡིན་པས་དེ་དག་ལ་བདག་པོ་བྱེད་དུ་འཇུག་པར་མི་འགྱུར་ལ།
en: Since they are immaterial and unreal, no one would install himself as their ruler.

source: ཆོས་ཐམས་ཅད་ནི་སྒྱུ་མ་ལྟ་བུའོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་ན་ཇི་ལྟར་དེ་དག་མཆོག་བྱེད་དུ་འཇུག་པར་འགྱུར།
en: When the Blessed One says that all phenomena are illusory, then what is to be looked upon as being supreme?

source: བྱང་ཆུབ་སེམས་དཔས་གང་དག་མཆོག་བྱེད་དུ་གཞུག་པར་བྱ་བའི་ཆོས་རྣམས་ནི་གང་ཡིན།
en: Which phenomena do bodhisattvas view as supreme?

source: གང་མཆོག་བྱེད་དུ་འཇུག་པའི་ཆོས་དེ་ནི་གང་ཡིན།
en: And what is it that establishes itself as being supreme?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ། གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་འགའ་ཞིག་ཡང་དག་པར་རྗེས་སུ་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་ཡིན་ནོ།
en: Venerable Śāradvatīputra said, “Venerable Pūrṇa, if bodhisattvas observe phenomena, they are not engaged in the perfection of insight.

source: །གང་གི་ཚེ་ཆོས་ཅི་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བ་ཡིན་ཏེ།
en: It is whenever they do not observe any phenomena that bodhisattvas become inseparable from the perfection of insight.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ལ་མཁས་པ་ཡིན་ནོ།
en: That is the bodhisattvas’ skill in means.

source: །ཆོས་གང་མཆོག་བྱེད་དུ་འཇུག་པའི་ཆོས་ཅི་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ལ།
en: The bodhisattvas’ perfection of discipline is to not regard any phenomenon as supreme, and then to become nonregressing from that state.

source: དེ་ལས་ཀྱང་ཕྱིར་མི་ལྡོག་པ་དེ་ཉིད་ནི་དེའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །གང་སྒྱུ་མ་ལྟ་བུའི་ཆོས་རྣམས་ཀྱི་བདག་པོར་ཉེ་བར་གནས་ལ་དེ་ལས་ཀྱང་ཕྱིར་མི་ལྡོག་པ་དང་བཙལ་བ་ཡང་འབྲས་བུ་དང་བཅས་པར་མཐོང་ལ་ཆོས་ཅི་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་བཞིན་དུ། དེ་ལས་ཀྱང་ཕྱིར་མི་ལྡོག་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཀྱི་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ།
en: Those who are nonregressing masters of illusory phenomena, and who strive and perceive the results yet do not observe any phenomena whatsoever, are called bodhisattvas who don the great armor of diligence because they are nonregressing from that state.

source: །དེ་ལྟར་འདིར་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་དུ་བཅས་པའི་འཇིག་རྟེན་རབ་ཏུ་འཇིག་ལ།
en: In general, the worlds of gods, humans, and asuras will all perish.

source: འདིར་འཇིག་པའང་གང་ཡང་མེད་དེ།
en: Within this state, however, nothing comes to an end.

source: དེ་ལྟ་བུར་བདག་ཉིད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་ནས་འདི་ལྟར་མིང་གི་ཚོགས་དང་། ཚིག་གི་ཚོགས་དང་། ཡི་གེའི་ཚོགས་རྣམས་ཀྱིས་ཞི་བའི་ཆོས་ཉིད་བཤད་པར་བྱའོ།
en: In this way, as they realize this identity and attain unsurpassed and perfect awakening, they will expound on the nature of peace using names, words, and letters. “

source: །ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་གང་ཡིན་པ་དེ་ནི་བརྗོད་པར་མི་ནུས་ཏེ།
en: The nature of all phenomena is ineffable.

source: ཚེ་དང་ལྡན་པ་གང་པོ་འོན་ཀྱང་ཆོས་ཐམས་ཅད་ནི་རབ་ཏུ་གསལ་བ་ཡིན་ལ་དེ་དག་ནི་བསྟན་པར་ཡང་མི་ནུས་སོ།
en: Venerable Pūrṇa, while all phenomena are clearly visible, they are nonetheless indescribable.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་འདི་སྐད་དུ། ཆོས་ཉིད་འདི་ནི་རབ་ཏུ་གསལ་བ་སྟེ།
en: When bodhisattvas awaken to unsurpassed and perfect buddhahood, they announce to beings, ‘I clearly perceive reality!

source: འདི་དག་ནི་ང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བསྟན་པ་མ་ཡིན་མོད་ཀྱི་ངས་ཇི་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་བཞིན་དུ་བསྟན་ཏོ།
en: Although it may be realized, it cannot be shown. Still, I teach it the way I have realized it.

source: །འོན་ཀྱང་སུ་ལ་ཡང་བསྟན་པ་མེད་ཅིང་སུ་ལ་ཡང་བསྟན་པར་མི་འགྱུར་རོ་ཞེས་གསུང་ངོ་།
en: Even so, it cannot be taught to anyone, nor will it ever be taught to anyone.’

source: །དེ་བས་ན་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པའི་སེམས་ཕྱིར་མི་ལྡོག་ཅིང་ཞུམ་པར་མི་འགྱུར་ཏེ།
en: Therefore, the minds of bodhisattva great beings who wish to awaken to unsurpassed and perfect buddhahood are nonregressing and never discouraged.

source: བརྩོན་འགྲུས་འབའ་ཞིག་ཡང་དག་པར་འཛིན་ལ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་ན་འདི་ནི་དེའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ།
en: If they are diligent at all times and dedicate that perfection of diligence toward the state of omniscience, then that is the perfection of discipline.

source: །དེའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཡོངས་སུ་དག་པའི་ཚུལ་ཁྲིམས་ཡིན་ཏེ།
en: If they dedicate that perfection of diligence toward the state of omniscience, then the perfection of discipline will be a pure form of discipline.

source: ཇི་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བ་དེ་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ཡིན་ནོ།
en: Merely by dedicating toward the state of omniscience the discipline of bodhisattvas becomes pure.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྒྱུ་མ་ལྟ་བུའི་ཆོས་རྣམས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཇི་ལྟར་ཡོངས་སུ་བསྔོ་བར་བྱ།
en: Venerable Pūrṇa said, “Venerable Śāradvatīputra, how does one dedicate illusory phenomena toward the state of omniscience?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་གལ་ཏེ་ཆོས་འདི་དག་སྒྱུ་མ་ལྟ་བུ་མ་ཡིན་དུ་ཟིན་ན་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བར་ཡང་ཤིན་ཏུ་མི་ནུས་ཏེ།
en: Venerable Śāradvatīputra said, “Venerable Pūrṇa, if these phenomena were not illusory, it would be utterly impossible to dedicate them toward omniscience.

source: གང་གི་ཕྱིར་ཆོས་འདི་དག་སྒྱུ་མ་ལྟ་བུར་གྱུར་པ་དེའི་ཚེ་ཆོས་འདི་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བར་ནུས་སོ།
en: It is precisely because these phenomena are illusory that it is possible to dedicate them toward omniscience.

source: །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་རྩོལ་བ་ཡང་མཐུ་དང་ལྡན་པ་ཡིན་ཞིང་བརྩོན་འགྲུས་ཀྱང་ཤིན་ཏུ་རྫོགས་པ་ཡིན་ནོ། །
en: That is why the bodhisattvas’ effort is so powerful and their diligence so complete.”

source: སྨྲས་པ། རྩོལ་བ་མཐུ་དང་ལྡན་པ་གང་ཡིན་པ་འདི་གང་གི་གནས་ཡིན།
en: Venerable Pūrṇa said, “That powerful effort, what does it support?”

source: སྨྲས་པ། འདི་ནི་ཐབས་ལ་མཁས་པའི་གནས་ཡིན་ཏེ།
en: Venerable Śāradvatīputra said, “It is the basis for being skilled in means.

source: ཐབས་ལ་མཁས་པ་ལ་བརྟེན་ནས་འདི་ལྟར་ཆོས་འདི་དག་ནི་དེ་ལྟར་ཐབས་ལ་མཁས་པ་ལ་གནས་སོ་སྙམ་དུ་ཤེས་ཏེ།
en: On the basis of such skill in means, they think, ‘In this way should I skillfully relate to these phenomena.’

source: དེ་ལ་གོམས་པར་ཡང་མི་བྱེད། ཡང་དག་པའི་མཐར་ཡང་མི་ལྟུང་ངོ་།
en: Thus they do not habituate themselves to them, nor fall into the limit of reality.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་མི་ཞིག་བྲག་གི་རྩེ་མོར་འདུག་ལ་ལག་པ་གཉིས་ན་གདུགས་ཐོགས་ཏེ་དམ་དུ་བཟུང་ནས་བྲག་དེའི་ཁར་བརྟེན་ལ་རྐང་པ་ཡ་གཅིག་གིས་ནུར་ཏེ།
en: As an analogy, think of a man standing on top of a tall cliff, holding an umbrella tightly in his two hands.

source: གཡང་ས་མི་བཟད་པ་བལྟ་ན་གཡང་སར་བཞག་ཀྱང་གདུགས་ཀྱིས་རླུང་ཐོགས་པར་བྱས་པའི་གདུགས་དེ་དག་དང་། རླུང་དེའི་སྟོབས་ཀྱི་ཤུགས་དེས་དེར་ལྟུང་བར་ཡང་མི་འགྱུར་རོ།
en: Even if he were to step right up to the edge, look down into that terrifying abyss, and extend his foot into the empty sky, the wind would hold up the umbrella and, due to its strength, prevent him from falling.

source: །དེ་ལྟར་བྲག་གི་ཁ་ན་འདུག་པའི་མི་དེས་བདག་ཉིད་གཡང་སར་འདུག་ཏུ་ཟིན་ཀྱང་གདུགས་དེ་དག་གིས་རླུང་ཐོགས་པར་བྱས་པའི་འདུ་བྱེད་ཀྱིས་བརྟེན་པས་དེ་གཡང་ས་དེ་ལ་ཡང་ལྟ་ཞིང་དེར་ལྟུང་བར་ཡང་མི་འགྱུར་རོ།
en: In this way the man standing at the edge of the cliff would be supported by the umbrella, which would be pushed up by the wind, even as he stepped into the void. In this way he would be able to look into the abyss without falling. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཐབས་ལ་མཁས་པ་ལ་ཡང་བརྟེན་ཅིང་སྙིང་རྗེ་ཆེན་པོས་ཀྱང་སྒྱུ་མ་ལྟ་བུའི་ཆོས་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་ལ་རྣམ་པར་ལྟ་སྟེ།
en: Venerable Pūrṇa, likewise, bodhisattva great beings who are skilled in means rely on skillful means and, with great compassion, behold illusory phenomena and understand them precisely as they are.

source: ཐབས་མཁས་པ་དེས་ཡོངས་སུ་ཟིན་པས་ཆོས་དེ་དག་ལ་གོམས་པར་བྱེད་པར་ཡང་མི་ལྟུང་ལ་དེའི་སེམས་ཀྱང་ཞུམ་པར་མི་འགྱུར།
en: As they employ skillful means, they do not fall into cultivating these phenomena, and do not become discouraged.

source: ཆོས་དེ་དག་ཀྱང་མངོན་སུམ་དུ་མི་བྱེད་དོ།
en: They also do not have realization with regard to these phenomena.

source: གཡང་ས་ཆེན་པོ་མི་བཟད་པ་དེ་ནི་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པའོ།
en: The terrifying abyss from the analogy represents realizing the emptiness of all phenomena.

source: །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་ཤིང་། ཐབས་ལ་མཁས་པས་ཡོངས་སུ་ཟིན་པ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕུང་པོ་དམ་པ་དང་ལྡན་པ་ཡིན་པར་རིག་པར་བྱའོ། །གང་མངོན་པར་འདུ་བྱ་བ་དང་།
en: You should understand that this is how bodhisattva great beings don the great armor and, employing skillful means, come to possess the sacred accumulation of the perfection of discipline.

source: གང་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱ་བའི་ཆོས་ཅི་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེ་ཉིད་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡིན་ཏེ།
en: The discipline of bodhisattvas refers to not perceiving any phenomena, whether actually formed or realized.

source: འདི་ཉིད་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: You should know that this is the bodhisattvas’ perfection of discipline.

source: །ཐབས་ལ་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་ཟིན་པར་རིག་པར་བྱའོ།
en: Bodhisattva great beings who are upholding the perfection of skillful means are also upholding all of the other perfections.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་མ་བྲལ་བ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྒོ་ན་གནས་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ནས་འགྲོའོ།
en: Bodhisattva great beings who are never apart from any of the perfections are standing at the gateway to omniscience from where they proceed, having surpassed the hearers and the solitary buddhas.

source: འདི་ལྟར་དེ་ནི་ཐམས་ཅད་མཁྱེན་པའི་རིན་པོ་ཆེ་འདོད་པའི་ཕྱིར་རོ།
en: That is because they have set their mind on the precious gem of omniscience. “
